app/controllers/records_controller.rb

  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("title", "description", "status", "created_at", "updated_at", "date", "artist") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    respond_to do |format|
      if @record.update(record_params)
---
UPDATE "records" SET "title" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["title", "Updated Title"], ["updated_at", "2024-12-17 11:52:32.842125"], ["id", 980190962]]

  def destroy
    @record.destroy!
---
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 980190962]]