app/controllers/students_controller.rb

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "email", "student_number", "course", "created_at", "updated_at") VALUES ('John Doe', 'x21522279@student.ncirl.ie', 'x21522279', 'Computer Science', '2024-12-17 11:43:20.164515', '2024-12-17 11:43:20.164515') RETURNING "id"

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Updated Name"], ["updated_at", "2024-12-17 11:50:23.961625"], ["id", 980190962]]

  def destroy
    @student.destroy!
---
DELETE FROM "students" WHERE "students"."id" = 1